In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
engine = create_engine("postgres+psycopg2://postgres:postgres@localhost:5432/Lahman Baseball")

In [3]:
batting_df = pd.read_sql("SELECT * FROM batting;", con=engine)
schools_df = pd.read_sql("SELECT * FROM schools;", con=engine)
college_playing_df = pd.read_sql("SELECT * FROM collegeplaying;", con=engine)
people_df = pd.read_sql("SELECT * FROM people;", con=engine)
salaries_df = pd.read_sql("SELECT * FROM salaries;", con=engine)
fielding_df = pd.read_sql("SELECT * FROM fielding;", con=engine)
teams_df = pd.read_sql("SELECT * FROM teams;", con=engine)
teams_franchises_df = pd.read_sql("SELECT * FROM teamsfranchises;", con=engine)
managers_df = pd.read_sql("SELECT * FROM managers;", con=engine)
awards_managers_df = pd.read_sql("SELECT * FROM awardsmanagers;", con=engine)
appearances_df = pd.read_sql("SELECT * FROM appearances;", con=engine)
awards_players_df = pd.read_sql("SELECT * FROM awardsplayers;", con=engine)
halloffame_df = pd.read_sql("SELECT * FROM halloffame;", con=engine)
pitching_df = pd.read_sql("SELECT * FROM pitching;", con=engine)

#### 1 a. Find all players in the database who played at Vanderbilt University.
#### b. Create a list showing each player’s first and last names as well as the total salary they earned in the major leagues.
#### c. Sort this list in descending order by the total salary earned.
#### d. Which Vanderbilt player earned the most money in the majors?

In [9]:
vandy_df = pd.merge(schools_df, college_playing_df, on='schoolid')
vandy_df = pd.merge(vandy_df, people_df, on='playerid')
vandy_df = pd.merge(vandy_df, salaries_df, on='playerid')

In [15]:
vandy_df.head(5)

,schoolid,schoolname,schoolcity,schoolstate,schoolnick,playerid,yearid_x,birthyear,birthmonth,birthday,...,bats,throws,debut,finalgame,retroid,bbrefid,yearid_y,teamid,lgid,salary
0,akron,University of Akron,Akron,OH,USA,birkbmi01,1980,1961.0,3.0,10.0,...,R,R,1986-08-17,1995-06-11,birkm001,birkbmi01,1986,ML4,AL,60000.0
1,akron,University of Akron,Akron,OH,USA,birkbmi01,1980,1961.0,3.0,10.0,...,R,R,1986-08-17,1995-06-11,birkm001,birkbmi01,1987,ML4,AL,70000.0
2,akron,University of Akron,Akron,OH,USA,birkbmi01,1980,1961.0,3.0,10.0,...,R,R,1986-08-17,1995-06-11,birkm001,birkbmi01,1988,ML4,AL,70000.0
3,akron,University of Akron,Akron,OH,USA,birkbmi01,1980,1961.0,3.0,10.0,...,R,R,1986-08-17,1995-06-11,birkm001,birkbmi01,1990,ML4,AL,155000.0
4,akron,University of Akron,Akron,OH,USA,birkbmi01,1981,1961.0,3.0,10.0,...,R,R,1986-08-17,1995-06-11,birkm001,birkbmi01,1986,ML4,AL,60000.0

In [16]:
vandy_sub = vandy_df[['schoolname', 'namefirst', 'namelast', 'salary', 'yearid_y']]
vandy_sub.head(5)

            schoolname namefirst  namelast    salary  yearid_y
0  University of Akron      Mike  Birkbeck   60000.0      1986
1  University of Akron      Mike  Birkbeck   70000.0      1987
2  University of Akron      Mike  Birkbeck   70000.0      1988
3  University of Akron      Mike  Birkbeck  155000.0      1990
4  University of Akron      Mike  Birkbeck   60000.0      1986

In [18]:
vandy_sub = vandy_sub[vandy_sub['schoolname'] == 'Vanderbilt University']
vandy_sub.tail(5)

                  schoolname namefirst   namelast    salary  yearid_y
35985  Vanderbilt University     Scott  Sanderson  250000.0      1995
35986  Vanderbilt University     Scott  Sanderson  200000.0      1996
35987  Vanderbilt University    Jeremy     Sowers  384800.0      2007
35988  Vanderbilt University    Jeremy     Sowers  384800.0      2007
35989  Vanderbilt University    Jeremy     Sowers  384800.0      2007

##### Need to filter out duplicate salaries, add total salary, rank

#### 2. Using the fielding table, group players into three groups based on their position: label players with position OF as "Outfield", those with position "SS", "1B", "2B", and "3B" as "Infield", and those with position "P" or "C" as "Battery". Determine the number of putouts made by each of these three groups in 2016.

#### 3. a. From 1970 – 2016, what is the largest number of wins for a team that did not win the world series?
#### b. What is the smallest number of wins for a team that did win the world series?
#### c. Doing this will probably result in an unusually small number of wins for a world series champion – determine why this is the case.
#### d. Then redo your query, excluding the problem year.
#### e. How often from 1970 – 2016 was it the case that a team with the most wins also won the world series?
#### f. What percentage of the time?

In [19]:
wins_base_df = pd.merge(teams_df, teams_franchises_df, on='franchid', how='left')
wins_base_df.head(5)

,yearid,lgid,teamid,franchid,divid,rank,g,ghome,w,l,...,park,attendance,bpf,ppf,teamidbr,teamidlahman45,teamidretro,franchname,active,naassoc
0,1871,NA,BS1,BNA,None,3,31,NaN,20,10,...,South End Grounds I,NaN,103,98,BOS,BS1,BS1,Boston Red Stockings,NA,ATL
1,1871,NA,CH1,CNA,None,2,28,NaN,19,9,...,Union Base-Ball Grounds,NaN,104,102,CHI,CH1,CH1,Chicago White Stockings,NA,CHC
2,1871,NA,CL1,CFC,None,8,29,NaN,10,19,...,National Association Grounds,NaN,96,100,CLE,CL1,CL1,Cleveland Forest Citys,NA,None
3,1871,NA,FW1,KEK,None,7,19,NaN,7,12,...,Hamilton Field,NaN,101,107,KEK,FW1,FW1,Fort Wayne Kekiongas,NA,None
4,1871,NA,NY2,NNA,None,5,33,NaN,16,17,...,Union Grounds (Brooklyn),NaN,90,88,NYU,NY2,NY2,New York Mutuals,NA,NYU

In [38]:
wins_ab_df = wins_base_df[['yearid','franchname','w','wswin']]
wins_ab_df = wins_ab_df[wins_ab_df['yearid'] > 1969]
wins_a_df = wins_ab_df[wins_ab_df['wswin'] == 'N']
wins_b_df = wins_ab_df[wins_ab_df['wswin'] == 'Y']
wins_a_df.tail(5)

      yearid            franchname   w wswin
2830    2016   St. Louis Cardinals  86     N
2831    2016        Tampa Bay Rays  68     N
2832    2016         Texas Rangers  95     N
2833    2016     Toronto Blue Jays  89     N
2834    2016  Washington Nationals  95     N

In [39]:
wins_a_df = wins_a_df.reset_index(drop=True)
wins_a_df.iloc[wins_a_df['w'].idxmax()]

yearid                    2001
franchname    Seattle Mariners
w                          116
wswin                        N
Name: 779, dtype: object

In [40]:
wins_b_df = wins_b_df.reset_index(drop=True)
wins_b_df.iloc[wins_b_df['w'].idxmin()]

yearid                       1981
franchname    Los Angeles Dodgers
w                              63
wswin                           Y
Name: 11, dtype: object

#### 4. Which managers have won the TSN Manager of the Year award in both the National League (NL) and the American League (AL)? Give their full name and the teams that they were managing when they won the award.